PhyEx-ux/llvm-project/validation/mcs251-porting/tests/stc32g144k246-direct-sfr-selfcheck-as6.c
/* Generated direct-SFR syntax self-check (AS6 flavor). */
#include "../generated/stc32g144k246-as6.h"

unsigned char sfr_header_selfcheck(void)
{
    volatile unsigned char sink = 0;
    sink ^= P0;
    sink ^= SP;
    sink ^= DPL;
    sink ^= DPH;
    sink ^= DPXL;
    sink ^= SPH;
    sink ^= PCON;
    sink ^= TCON;
    sink ^= TMOD;
    sink ^= TL0;
    sink ^= TL1;
    sink ^= TH0;
    sink ^= TH1;
    sink ^= AUXR;
    sink ^= INTCLKO;
    sink ^= P1;
    sink ^= P1M1;
    sink ^= P1M0;
    sink ^= P0M1;
    sink ^= P0M0;
    sink ^= P2M1;
    sink ^= P2M0;
    sink ^= AUXR2;
    sink ^= SCON;
    sink ^= SBUF;
    sink ^= S2CON;
    sink ^= S2BUF;
    sink ^= IRCBAND;
    sink ^= LIRTRIM;
    sink ^= IRTRIM;
    sink ^= P2;
    sink ^= BUS_SPEED;
    sink ^= P_SW1;
    sink ^= VRTRIM;
    sink ^= IE;
    sink ^= SADDR;
    sink ^= WKTCL;
    sink ^= WKTCH;
    sink ^= S3CON;
    sink ^= S3BUF;
    sink ^= TA;
    sink ^= IE2;
    sink ^= P3;
    sink ^= P3M1;
    sink ^= P3M0;
    sink ^= P4M1;
    sink ^= P4M0;
    sink ^= IP2;
    sink ^= IP2H;
    sink ^= IPH;
    sink ^= IP;
    sink ^= SADEN;
    sink ^= P_SW2;
    sink ^= P_SW3;
    sink ^= ADC_CONTR;
    sink ^= ADC_RES;
    sink ^= ADC_RESL;
    sink ^= P_SW4;
    sink ^= P4;
    sink ^= WDT_CONTR;
    sink ^= IAP_DATA;
    sink ^= IAP_ADDRH;
    sink ^= IAP_ADDRL;
    sink ^= IAP_CMD;
    sink ^= IAP_TRIG;
    sink ^= IAP_CONTR;
    sink ^= P5;
    sink ^= P5M1;
    sink ^= P5M0;
    sink ^= P6M1;
    sink ^= P6M0;
    sink ^= SPSTAT;
    sink ^= SPCTL;
    sink ^= SPDAT;
    sink ^= PSW;
    sink ^= PSW1;
    sink ^= T4H;
    sink ^= T4L;
    sink ^= T3H;
    sink ^= T3L;
    sink ^= T2H;
    sink ^= T2L;
    sink ^= TH4;
    sink ^= TL4;
    sink ^= TH3;
    sink ^= TL3;
    sink ^= TH2;
    sink ^= TL2;
    sink ^= USBCLK;
    sink ^= T3T4M;
    sink ^= T4T3M;
    sink ^= ADCCFG;
    sink ^= IP3;
    sink ^= ACC;
    sink ^= P7M1;
    sink ^= P7M0;
    sink ^= DPS;
    sink ^= CMPCR1;
    sink ^= CMPCR2;
    sink ^= P6;
    sink ^= WTST;
    sink ^= CKCON;
    sink ^= MXAX;
    sink ^= USBDAT;
    sink ^= DMAIR;
    sink ^= IP3H;
    sink ^= AUXINTIF;
    sink ^= B;
    sink ^= USBCON;
    sink ^= IAP_TPS;
    sink ^= IAP_ADDRE;
    sink ^= P7;
    sink ^= LINICR;
    sink ^= LINAR;
    sink ^= LINDR;
    sink ^= USBADR;
    sink ^= S4CON;
    sink ^= S4BUF;
    return sink;
}
